In [1]:
#Data Cleaning

In [6]:
import pandas as pd

In [7]:
df = pd.read_csv('clean.csv')
df

       Name  English Hindi Math Science  Social Science
0   Manisha     98.0    90   69      85              85
1    Seemaj     56.0    81   yh      56              56
2  Mukesh..     33.0    74   85      55              56
3      Raja     45.0    ef   84      jk              95
4    ..Deep     45.0    95   80      75              75
5    Sakshi      NaN   NaN  NaN     NaN              52
6    Sakshi      NaN   NaN  NaN     NaN              52

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            7 non-null      object
 1   English         5 non-null      float64
 2   Hindi           5 non-null      object
 3   Math            5 non-null      object
 4   Science         5 non-null      object
 5   Social Science  7 non-null      int64
dtypes: float64(1), int64(1), object(4)
memory usage: 468.0+ bytes

In [9]:
#find duplicate
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [10]:
#remove duplicate
df.drop_duplicates( inplace= True)

In [11]:
df

       Name  English Hindi Math Science  Social Science
0   Manisha     98.0    90   69      85              85
1    Seemaj     56.0    81   yh      56              56
2  Mukesh..     33.0    74   85      55              56
3      Raja     45.0    ef   84      jk              95
4    ..Deep     45.0    95   80      75              75
5    Sakshi      NaN   NaN  NaN     NaN              52

In [12]:
#remove column
df.drop(columns = 'Math', inplace=True)
df

       Name  English Hindi Science  Social Science
0   Manisha     98.0    90      85              85
1    Seemaj     56.0    81      56              56
2  Mukesh..     33.0    74      55              56
3      Raja     45.0    ef      jk              95
4    ..Deep     45.0    95      75              75
5    Sakshi      NaN   NaN     NaN              52

In [13]:
# remove right mistake
df['Name'].str.rstrip('..')

0    Manisha
1     Seemaj
2     Mukesh
3       Raja
4     ..Deep
5     Sakshi
Name: Name, dtype: object

In [14]:
#remove left mistake
df['Name'].str.lstrip('..')

0     Manisha
1      Seemaj
2    Mukesh..
3        Raja
4        Deep
5      Sakshi
Name: Name, dtype: object

In [15]:
df

       Name  English Hindi Science  Social Science
0   Manisha     98.0    90      85              85
1    Seemaj     56.0    81      56              56
2  Mukesh..     33.0    74      55              56
3      Raja     45.0    ef      jk              95
4    ..Deep     45.0    95      75              75
5    Sakshi      NaN   NaN     NaN              52

In [16]:
df['Name'].str.rstrip('j')

0     Manisha
1       Seema
2    Mukesh..
3        Raja
4      ..Deep
5      Sakshi
Name: Name, dtype: object

In [17]:
df['Name'].str.strip('..')

0    Manisha
1     Seemaj
2     Mukesh
3       Raja
4       Deep
5     Sakshi
Name: Name, dtype: object

In [18]:
#df['Name'].str.strip('[^a-zA-Z0-9]','Manisha', regex = True)

In [19]:
#find null value
df.isnull()

    Name  English  Hindi  Science  Social Science
0  False    False  False    False           False
1  False    False  False    False           False
2  False    False  False    False           False
3  False    False  False    False           False
4  False    False  False    False           False
5  False     True   True     True           False

In [20]:
df.isnull().sum()

Name              0
English           1
Hindi             1
Science           1
Social Science    0
dtype: int64

In [21]:
# change columns names
df.rename(columns = {'Name' : 'Students','Hindi':'hindi'}, inplace = True)

In [22]:
df

   Students  English hindi Science  Social Science
0   Manisha     98.0    90      85              85
1    Seemaj     56.0    81      56              56
2  Mukesh..     33.0    74      55              56
3      Raja     45.0    ef      jk              95
4    ..Deep     45.0    95      75              75
5    Sakshi      NaN   NaN     NaN              52

In [23]:
# total
df['Total'] = 0
df

   Students  English hindi Science  Social Science  Total
0   Manisha     98.0    90      85              85      0
1    Seemaj     56.0    81      56              56      0
2  Mukesh..     33.0    74      55              56      0
3      Raja     45.0    ef      jk              95      0
4    ..Deep     45.0    95      75              75      0
5    Sakshi      NaN   NaN     NaN              52      0

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Students        6 non-null      object
 1   English         5 non-null      float64
 2   hindi           5 non-null      object
 3   Science         5 non-null      object
 4   Social Science  6 non-null      int64
 5   Total           6 non-null      int64
dtypes: float64(1), int64(2), object(3)
memory usage: 336.0+ bytes

In [25]:
df['Total'] = df['Social Science']+df['English']

In [26]:
df

   Students  English hindi Science  Social Science  Total
0   Manisha     98.0    90      85              85  183.0
1    Seemaj     56.0    81      56              56  112.0
2  Mukesh..     33.0    74      55              56   89.0
3      Raja     45.0    ef      jk              95  140.0
4    ..Deep     45.0    95      75              75  120.0
5    Sakshi      NaN   NaN     NaN              52    NaN

In [27]:
df['hindi'] = df['hindi'].str.replace("[A-Za-z]","",regex=True)

In [28]:
df

   Students  English hindi Science  Social Science  Total
0   Manisha     98.0    90      85              85  183.0
1    Seemaj     56.0    81      56              56  112.0
2  Mukesh..     33.0    74      55              56   89.0
3      Raja     45.0            jk              95  140.0
4    ..Deep     45.0    95      75              75  120.0
5    Sakshi      NaN   NaN     NaN              52    NaN

In [29]:
df.describe()

         English  Social Science       Total
count   5.000000        6.000000    5.000000
mean   55.400000       69.833333  128.800000
std    25.165453       17.837227   35.379373
min    33.000000       52.000000   89.000000
25%    45.000000       56.000000  112.000000
50%    45.000000       65.500000  120.000000
75%    56.000000       82.500000  140.000000
max    98.000000       95.000000  183.000000

In [31]:
mean = df['English'].mean()
mean

55.4

In [32]:
median = df['English'].median()
median

45.0

In [33]:
mode = df['English'].mode()
mode

0    45.0
Name: English, dtype: float64

In [34]:
#find null value = True, missing data
df['English'].isnull().any()

True

In [35]:
#null value not find = False
df['Social Science'].isnull().any()

False

In [41]:
#fill
df['Science'].fillna(median, inplace=True)
df

   Students  English hindi Science  Social Science  Total
0   Manisha     98.0    90      85              85  183.0
1    Seemaj     56.0    81      56              56  112.0
2  Mukesh..     33.0    74      55              56   89.0
3      Raja     45.0            jk              95  140.0
4    ..Deep     45.0    95      75              75  120.0
5    Sakshi     45.0  45.0    45.0              52    NaN

In [49]:
median = df['Total'].median()
median

120.0

In [50]:
df.replace(to_replace = 183, value = 999)

   Students  English hindi Science  Social Science  Total
0   Manisha     98.0    90      85              85  999.0
1    Seemaj     56.0    81      56              56  112.0
2  Mukesh..     33.0    74      55              56   89.0
3      Raja     45.0            jk              95  140.0
4    ..Deep     45.0    95      75              75  120.0
5    Sakshi     45.0  45.0    45.0              52    NaN

In [51]:
df['Total'].describe()

count      5.000000
mean     292.000000
std      395.646939
min       89.000000
25%      112.000000
50%      120.000000
75%      140.000000
max      999.000000
Name: Total, dtype: float64

In [60]:
#replace value
df['hindi'].replace(to_replace='',value=90, inplace = True)

In [61]:
df

   Students  English hindi Science  Social Science  Total
0   Manisha     98.0    90      85              85  999.0
1    Seemaj     56.0    81      56              56  112.0
2  Mukesh..     33.0    74      55              56   89.0
3      Raja     45.0    90      jk              95  140.0
4    ..Deep     45.0    95      75              75  120.0
5    Sakshi     45.0  45.0    45.0              52    NaN